QX-18/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0.0;
    }
    
    outlet
    {
        type            freestreamPressure;
        freestreamValue uniform 0.0;
    }

    airplane
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            slip;
    }
    
    upperWall
    {
        type            slip;
    }

    frontAndBack
    {
        type            slip;
    }
}

// ************************************************************************* //
